// 1. Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.




// 2. Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.











// 3. Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.

/*
void Cube (int N)
{
    int result = 1;
    while (result <= N)
    {
        Console.Write(Math.Pow(result, 3) + " ");
        result ++;
    }
}

Console.WriteLine("Input a number:  ");
int N = Convert.ToInt32(Console.ReadLine());
Cube(N);
*/